mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
    if(esp8266_http_server.hasArg("iotype")){
      device.setType(esp8266_http_server.arg("iotype"));
    }

    if(esp8266_http_server.hasArg("iopin")){
      device.iopin = esp8266_http_server.arg("iopin").toInt();
    }
    if(esp8266_http_server.hasArg("io_default")){
      device.io_default = esp8266_http_server.arg("io_default").toInt();
    }
    if(esp8266_http_server.hasArg("inverted")){
      device.setInverted(esp8266_http_server.arg("inverted"));
    }

    SetDevice(index, device);

    sucess &= bufferInsert("device: " + esp8266_http_server.arg("device") + "\n");

    // Force reconnect to MQTT so we subscribe to any new addresses.
    mqtt->forceDisconnect();
    io->setup();
  }
  

  Serial.println(buffer);

  Serial.println("onSet() -");
  if(sucess){
    //Persist_Data::Persistent<Config> persist_config(config);
    //persist_config.writeConfig();
    config->save();
  }
  esp8266_http_server.send((sucess ? 200 : 500), "text/plain", buffer);
}

void HttpServer::onReset() {
  Serial.println("restarting host");
  delay(100);
  ESP.reset();

  esp8266_http_server.send(200, "text/plain", "restarting host");
}

void HttpServer::bufferClear(){
  buffer[0] = '\0';
}

bool HttpServer::bufferAppend(const String& to_add){
  return bufferAppend(to_add.c_str());
}

bool HttpServer::bufferAppend(const char* to_add){
  strncat(buffer, to_add, buffer_size - strlen(buffer) -1);
  return ((buffer_size - strlen(buffer) -1) >= strlen(to_add));
}

bool HttpServer::bufferInsert(const String& to_insert){
  return bufferInsert(to_insert.c_str());
}

bool HttpServer::bufferInsert(const char* to_insert){
  if((buffer_size - strlen(buffer) -1) >= strlen(to_insert)){
    *(buffer + strlen(to_insert) + strlen(buffer)) = '\0';
    memmove(buffer + strlen(to_insert), buffer, strlen(buffer));
    memcpy(buffer, to_insert, strlen(to_insert));
    return true;
  }
  return false;
}

void HttpServer::mustacheCompile(char* buff){
  Serial.println("mustacheCompile");
  ESP.wdtDisable(); 

  for(int i = 0; i < MAX_LIST_RECURSION; i++){
    list_element[i] = -1;
    list_size[i] = -1;
  }
  char* buffer_position = buff;
  char line[255] = "";

  while(buffer_position <= buff + strnlen(buff, buffer_size)){
    // Strip leading whitespace.
    // TODO: Only need to do this once and re-save the results.
    char* start_text = buffer_position +1;
    while((*start_text == ' ' || *start_text == 9/*tab*/) && strlen(start_text)){
      start_text++;
    }
    memmove(buffer_position +1, start_text, strlen(start_text) +1);

    // Get a line.
    char* end_line = strchr(buffer_position +1, 13);  // Look for newline char.
    if(!end_line){
      Serial.println("no eol");
      break;
    }

    // DEBUG
      strncpy(line, buffer_position,
          (end_line - buffer_position >= 254)? 254:end_line - buffer_position);
      line[(end_line - buffer_position >= 255)? 255:end_line - buffer_position] = '\0';
      Serial.print("* ");
      Serial.println(line);

    char* tag_end = parseTag(buffer_position, end_line - buffer_position);
    if(tag_end) {
      end_line = tag_end;
    }
    
    buffer_position = end_line;
  }
  ESP.wdtEnable(0);
}

char* HttpServer::parseTag(char* buff, int line_len){
  char tag[64] = "";
  char tag_content[128] = "";
  tagType type;
  char* tag_start = findPattern(buff, "{{", line_len);
  if(tag_start){
    bool found_tag = tagName(tag_start, tag, type);
      if(found_tag){
        replaceTag(tag_start, tag, tag_content, type);
        switch(type)
        {
          case tagList:
            list_depth++;
            if(list_depth < MAX_LIST_RECURSION){
              list_element[list_depth] = -1;
              list_size[list_depth] = -1;
              Serial.print("######## ");
              Serial.print(list_depth);
              Serial.print(" ");
              Serial.println(tag);
              strncat(list_parent, "|", strlen(list_parent) - 1);
              strncat(list_parent, tag, strlen(list_parent) - strlen(tag));
              list_parent[128] = '\0';
            }
            return tag_start;
          case tagEnd:
            if(list_depth > 0){
              list_depth--;
              Serial.print("//////// ");
              Serial.print(list_depth);
              Serial.print(" ");
              Serial.println(tag);
              char* deliminator = strrchr(list_parent, '|');
              *deliminator = '\0';
            } else {
              Serial.println("Warning: Closing list tag that was never opened.");
            }
            return tag_start;
          default:
            return tag_start + strlen(tag_content);
        }
      }
      return tag_start + strlen("{{");
  }
  return NULL;
}

bool HttpServer::tagName(char* tag_start, char* tag, tagType& type){
  type = tagUnset;
  for(int i = 0; i < 100; i++){
    // Skip through any "{{" deliminators and whitespace to start of tag name.
    if(*tag_start >= '!' and *tag_start <= 'z' and
        *tag_start != '#' and *tag_start != '/' and
        *tag_start != '^' and *tag_start != '+'){
      break;
    }
    switch(*tag_start)
    {
      case '#':
        if(type != tagUnset) {return false;}
        type = tagList;
        break;
      case '^':
        if(type != tagUnset) {return false;}
        type = tagInverted;
        break;
      case '/':
        if(type != tagUnset) {return false;}
        type = tagEnd;
        break;
      case '+':
        if(type != tagUnset) {return false;}
        type = tagListItem;
    }

    tag_start ++;
  }
  if(type == tagUnset){
    type = tagPlain;
  }

  if(findPattern(tag_start, "}}", 64)){
    strncpy(tag, tag_start, 64);
    char* end_pattern = findPattern(tag, "}}", 64);
    if(end_pattern){
      *end_pattern = '\0';
      while(strlen(tag)){
        if(tag[strlen(tag)] == ' '){
          // Remove trailing whitespace.
          tag[strlen(tag)] = '\0';
        } else {
          break;
        }
      }
      return true;
    }
    // empty string.
    tag[0] = '\0';
  }
  return false;
}

